HermanoLCampos/f28386D-QPC/Cores_Project/CPU1/vpu_mvp_board_s.syscfg
adc3.$name                   = "myADCC";
adc3.adcBase                 = "ADCC_BASE";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc3.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc3.adcSignalMode           = "ADC_MODE_DIFFERENTIAL";
adc3.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc3.soc0Channel             = "ADC_CH_ADCIN2_ADCIN3";
adc3.soc0SampleWindow        = 96;
adc3.soc1SampleWindow        = 96;
adc3.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc3.enabledInts             = ["ADC_INT_NUMBER1"];
adc3.enableInterrupt1        = true;
adc3.interrupt1SOCSource     = "ADC_SOC_NUMBER1";
adc3.registerInterrupts      = ["1"];
adc3.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc0Name                = "SKIIP2_CURRENT";
adc3.soc1Channel             = "ADC_CH_ADCIN14_ADCIN15";
adc3.soc1Name                = "HALL1_CURRENT";
adc3.adcInt1.enableInterrupt = true;

adc4.adcBase                 = "ADCD_BASE";
adc4.$name                   = "myADCD";
adc4.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc4.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc4.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc4.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc4.soc0Channel             = "ADC_CH_ADCIN1";
adc4.soc0SampleWindow        = 96;
adc4.soc1Channel             = "ADC_CH_ADCIN8";
adc4.soc1SampleWindow        = 96;
adc4.soc2SampleWindow        = 96;
adc4.soc3SampleWindow        = 96;
adc4.soc3Channel             = "ADC_CH_ADCIN9";
adc4.soc4Channel             = "ADC_CH_ADCIN2";
adc4.soc4SampleWindow        = 96;
adc4.soc5Channel             = "ADC_CH_ADCIN9";
adc4.soc5SampleWindow        = 96;
adc4.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc4.enabledInts             = ["ADC_INT_NUMBER1"];
adc4.enableInterrupt1        = true;
adc4.registerInterrupts      = ["1"];
adc4.interrupt1SOCSource     = "ADC_SOC_NUMBER5";
adc4.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc3Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc4Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc5Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc1Name                = "VREFLOD_1";
adc4.soc0Name                = "SKIIP1_TEMP";
adc4.soc2Name                = "SKIIP2_TEMP";
adc4.soc3Name                = "VREFLOD_2";
adc4.soc4Name                = "SBC_MUXOUT";
adc4.soc5Name                = "VREFLOD_3";
adc4.adcInt1.enableInterrupt = true;

asysctl.enableTemperatureSensor = true;

can1.msgObjsUsed           = [1,2,3,4,5,6];
can1.registerInterrupts    = true;
can1.interruptFlags        = ["CAN_INT_ERROR","CAN_INT_IE0","CAN_INT_STATUS"];
can1.interruptLine         = ["CAN_GLOBAL_INT_CANINT0"];
can1.$name                 = "CAN1";
can1.can.$assign           = "CANA";
can1.can.can_rxPin.$assign = "GPIO62";
can1.can.can_txPin.$assign = "GPIO63";
can1.msgObj1.$name         = "msgObj0";
can1.msgObj1.msgID         = 1580;
can1.msgObj1.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj1.flags         = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can1.msgObj1.msgLen        = 8;
can1.msgObj2.$name         = "msgObj1";
can1.msgObj2.msgID         = 1452;
can1.msgObj2.flags         = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can1.msgObj3.$name         = "msgObj2";
can1.msgObj3.msgID         = 1581;
can1.msgObj3.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj3.flags         = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can1.msgObj3.msgLen        = 8;
can1.msgObj4.$name         = "msgObj3";
can1.msgObj4.msgID         = 1453;
can1.msgObj4.flags         = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can1.msgObj5.$name         = "msgObj4";
can1.msgObj5.msgID         = 1836;
can1.msgObj5.flags         = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can1.msgObj6.$name         = "msgObj5";
can1.msgObj6.msgID         = 1837;
can1.msgObj6.flags         = ["CAN_MSG_OBJ_RX_INT_ENABLE"];

can2.msgObjsUsed           = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16];
can2.enableInterrupt       = true;
can2.registerInterrupts    = true;
can2.interruptFlags        = ["CAN_INT_ERROR","CAN_INT_IE0","CAN_INT_STATUS"];
can2.interruptLine         = ["CAN_GLOBAL_INT_CANINT0"];
can2.$name                 = "CAN2";
can2.can.$assign           = "CANB";
can2.can.can_rxPin.$assign = "GPIO39";
can2.can.can_txPin.$assign = "GPIO38";
can2.msgObj1.$name         = "msgObj6";
can2.msgObj1.msgID         = 660;
can2.msgObj1.flags         = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can2.msgObj2.$name         = "msgObj7";
can2.msgObj2.msgID         = 661;
can2.msgObj2.flags         = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can2.msgObj3.$name         = "msgObj8";
can2.msgObj3.msgID         = 662;
can2.msgObj3.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj3.flags         = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj3.msgLen        = 8;
can2.msgObj4.$name         = "msgObj9";
can2.msgObj4.msgID         = 663;
can2.msgObj4.flags         = ["CAN_MSG_OBJ_RX_INT_ENABLE"];
can2.msgObj5.$name         = "msgObj12";
can2.msgObj5.msgID         = 664;
can2.msgObj5.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj5.flags         = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj5.msgLen        = 8;
can2.msgObj6.$name         = "msgObj10";
can2.msgObj6.msgID         = 665;
can2.msgObj6.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj6.flags         = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj6.msgLen        = 8;
can2.msgObj7.$name         = "msgObj11";
can2.msgObj7.msgID         = 666;
can2.msgObj7.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj7.msgLen        = 8;
can2.msgObj7.flags         = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj8.$name         = "msgObj13";
can2.msgObj8.msgID         = 667;
can2.msgObj8.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj8.flags         = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj8.msgLen        = 8;
can2.msgObj9.$name         = "msgObj14";
can2.msgObj9.msgID         = 668;
can2.msgObj9.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj9.flags         = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj9.msgLen        = 6;
can2.msgObj10.$name        = "msgObj15";
can2.msgObj10.msgID        = 669;
can2.msgObj10.msgType      = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj10.flags        = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj10.msgLen       = 6;
can2.msgObj11.$name        = "msgObj16";
can2.msgObj11.msgID        = 670;
can2.msgObj11.msgType      = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj11.flags        = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj11.msgLen       = 7;
can2.msgObj12.$name        = "msgObj18";
can2.msgObj12.msgID        = 671;
can2.msgObj12.msgType      = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj12.flags        = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj12.msgLen       = 7;
can2.msgObj13.$name        = "msgObj17";
can2.msgObj13.msgID        = 672;
can2.msgObj13.msgType      = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj13.flags        = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj13.msgLen       = 8;
can2.msgObj14.$name        = "msgObj19";
can2.msgObj14.msgID        = 673;
can2.msgObj14.msgType      = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj14.flags        = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj14.msgLen       = 8;
can2.msgObj15.$name        = "msgObj20";
can2.msgObj15.msgID        = 674;
can2.msgObj15.msgType      = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj15.flags        = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj15.msgLen       = 8;
can2.msgObj16.$name        = "msgObj21";
can2.msgObj16.msgID        = 675;
can2.msgObj16.msgType      = "CAN_MSG_OBJ_TYPE_TX";
can2.msgObj16.flags        = ["CAN_MSG_OBJ_TX_INT_ENABLE"];
can2.msgObj16.msgLen       = 8;

