HermanoLCampos/f28386D-QPC/Cores_Project/CPU1/vpu_mvp_board_s.syscfg
cla1.$name              = "myCLA0";
cla1.trigger_CLA_TASK_1 = "CLA_TRIGGER_ADCD1";
cla1.trigger_CLA_TASK_2 = "CLA_TRIGGER_EPWM4INT";

const divider6       = system.clockTree["ECATDIV"];
divider6.divideValue = 4;

const divider8       = system.clockTree["EPWMCLKDIV"];
divider8.divideValue = 1;

const multiplier1         = system.clockTree["AUX_IMULT"];
multiplier1.multiplyValue = 50;

const multiplier2         = system.clockTree["PLL_IMULT"];
multiplier2.multiplyValue = 40;

const mux11       = system.clockTree["DIVSRCSEL"];
mux11.inputSelect = "PLLSYSCLK";

const mux18       = system.clockTree["XTAL_OR_X1"];
mux18.inputSelect = "XTAL";

const pinFunction3     = system.clockTree["XTAL"];
pinFunction3.XTAL_Freq = 20;

epwm1.$name                                                        = "GD_HB_1";
epwm1.epwmTimebase_hsClockDiv                                      = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmTimebase_counterMode                                     = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.epwmTimebase_syncInPulseSource                               = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm1.epwmTimebase_syncOutPulseMode                                = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode              = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA     = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode              = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmDeadband_polarityFED                                     = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.epwmDeadband_delayRED                                        = 800;
epwm1.epwmDeadband_delayFED                                        = 800;
epwm1.epwmEventTrigger_enableInterrupt                             = true;
epwm1.epwmEventTrigger_interruptEventCount                         = "1";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                    = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource                    = "EPWM_SOC_TBCTR_PERIOD";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar            = "1";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEnable                    = true;
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerSource                    = "EPWM_SOC_TBCTR_PERIOD";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar            = "1";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                        = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_oneShotSource                                   = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm1.epwmTripZone_tzInterruptSource                               = ["EPWM_TZ_INTERRUPT_OST"];
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                        = "EPWM_TZ_ACTION_HIGH";
epwm1.epwmTimebase_period                                          = 50000;
epwm1.hrpwm_syncSource                                             = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm1.epwmEventTrigger_interruptSource                             = "EPWM_INT_TBCTR_ZERO";
epwm1.epwmCounterCompare_cmpA                                      = 50000;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB     = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmCounterCompare_cmpB                                      = 49400;
epwm1.epwm.$assign                                                 = "EPWM4";
epwm1.epwm.epwm_aPin.$assign                                       = "GPIO6";
epwm1.epwm.epwm_bPin.$assign                                       = "GPIO7";

epwm2.$name                                                        = "GD_HB_2";
epwm2.epwmTimebase_hsClockDiv                                      = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_counterMode                                     = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmTimebase_syncInPulseSource                               = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm2.epwmTimebase_syncOutPulseMode                                = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm2.epwmDeadband_delayRED                                        = 560;
epwm2.epwmDeadband_delayFED                                        = 520;
epwm2.epwmDeadband_polarityFED                                     = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmEventTrigger_enableInterrupt                             = true;
epwm2.epwmEventTrigger_registerInterrupts                          = true;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode              = true;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode              = true;
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                        = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_oneShotSource                                   = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                        = "EPWM_TZ_ACTION_HIGH";
epwm2.epwmTimebase_period                                          = 50000;
epwm2.epwmTimebase_phaseEnable                                     = true;
epwm2.epwmTimebase_counterModeAfterSync                            = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm2.hrpwm_syncSource                                             = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm2.epwmCounterCompare_cmpA                                      = 50000;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_HIGH";
epwm2.epwmCounterCompare_cmpB                                      = 49400;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB     = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA     = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwm.$assign                                                 = "EPWM3";
epwm2.epwm.epwm_aPin.$assign                                       = "GPIO4";
epwm2.epwm.epwm_bPin.$assign                                       = "GPIO5";
epwm2.epwmInt.enableInterrupt                                      = true;

epwm3.$name                                                        = "FO_HB_1";
epwm3.epwmTimebase_hsClockDiv                                      = "EPWM_HSCLOCK_DIVIDER_1";
epwm3.epwmTimebase_counterMode                                     = "EPWM_COUNTER_MODE_UP_DOWN";
epwm3.epwmTimebase_syncInPulseSource                               = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm3.epwmTimebase_syncOutPulseMode                                = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm3.epwmEventTrigger_enableInterrupt                             = true;
epwm3.epwmEventTrigger_registerInterrupts                          = true;
epwm3.epwmEventTrigger_interruptEventCount                         = "1";
epwm3.epwmEventTrigger_interruptSource                             = "EPWM_INT_TBCTR_PERIOD";
epwm3.useCase                                                      = "CUSTOM";
epwm3.epwmDeadband_delayRED                                        = 560;
epwm3.epwmDeadband_delayFED                                        = 520;
epwm3.epwmDeadband_polarityRED                                     = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                        = "EPWM_TZ_ACTION_LOW";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                        = "EPWM_TZ_ACTION_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB   = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode              = true;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode              = true;
epwm3.epwmTimebase_period                                          = 50000;
epwm3.epwmTimebase_phaseEnable                                     = true;
epwm3.epwmTimebase_counterModeAfterSync                            = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm3.epwmCounterCompare_cmpB                                      = 1;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB     = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA     = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmCounterCompare_cmpA                                      = 601;
epwm3.epwmInt.enableInterrupt                                      = true;
epwm3.epwm.$assign                                                 = "EPWM12";

epwm4.$name                                                        = "FO_HB_2";
epwm4.epwmTimebase_hsClockDiv                                      = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_counterMode                                     = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmTimebase_syncInPulseSource                               = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm4.epwmTimebase_syncOutPulseMode                                = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode              = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode              = true;
epwm4.epwmDeadband_delayRED                                        = 560;
epwm4.epwmDeadband_delayFED                                        = 520;
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                        = "EPWM_TZ_ACTION_LOW";
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                        = "EPWM_TZ_ACTION_HIGH";
epwm4.epwmTripZone_oneShotSource                                   = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm4.epwmEventTrigger_enableInterrupt                             = true;
epwm4.epwmEventTrigger_registerInterrupts                          = true;
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEnable                    = true;
epwm4.epwmEventTrigger_EPWM_SOC_B_triggerEnable                    = true;
epwm4.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar            = "1";
epwm4.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar            = "1";
epwm4.useCase                                                      = "CUSTOM";
epwm4.epwmTimebase_period                                          = 50000;
epwm4.epwmTimebase_phaseEnable                                     = true;
epwm4.epwmTimebase_counterModeAfterSync                            = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm4.epwmCounterCompare_cmpB                                      = 1;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_continuousSwForceAction = "EPWM_AQ_SW_OUTPUT_LOW";
epwm4.epwmCounterCompare_cmpA                                      = 601;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPB     = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPB   = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA     = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmInt.enableInterrupt                                      = true;
epwm4.epwm.$assign                                                 = "EPWM8";

epwm5.$name                                             = "Sample_Timer";
epwm5.epwmTimebase_hsClockDiv                           = "EPWM_HSCLOCK_DIVIDER_1";
epwm5.epwmTimebase_counterMode                          = "EPWM_COUNTER_MODE_UP_DOWN";
epwm5.useCase                                           = "CUSTOM";
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerEnable         = true;
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerSource         = "EPWM_SOC_TBCTR_PERIOD";
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar = "1";
epwm5.epwmTimebase_syncInPulseSource                    = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm5.epwmTimebase_period                               = 5000;
epwm5.epwm.$assign                                      = "EPWM1";

gpio1.$name             = "LED1";
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.writeInitialValue = true;
gpio1.initialValue      = 1;
gpio1.gpioPin.$assign   = "GPIO9";

